{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Model", "config": {"name": "efficientnet-b5", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 456, 456, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "group_normalization_1", "class_name": "GroupNormalization", "config": {"name": "group_normalization_1", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_1", "class_name": "Swish", "config": {"name": "swish_1", "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "depthwise_conv2d_1", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_1", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["swish_1", 0, 0, {}]]]}, {"name": "group_normalization_2", "class_name": "GroupNormalization", "config": {"name": "group_normalization_2", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_2", "class_name": "Swish", "config": {"name": "swish_2", "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxAAAAB0AGoBfACIAGQBZAKNA1MAKQNOVCkC2gRheGlz2ghr\nZWVwZGltcykC2gFL2gRtZWFuKQHaAWEpAdoMc3BhdGlhbF9kaW1zqQD6WC9rYWdnbGUvaW5wdXQv\nZWZmaWNpZW50bmV0L2VmZmljaWVudG5ldC1tYXN0ZXIvZWZmaWNpZW50bmV0LW1hc3Rlci9lZmZp\nY2llbnRuZXQvbW9kZWwucHnaCDxsYW1iZGE+XwAAAHMAAAAA\n", null, [[1, 2]]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["swish_2", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 12, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "swish_3", "class_name": "Swish", "config": {"name": "swish_3", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["swish_3", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "multiply_1", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true}, "inbound_nodes": [[["activation_1", 0, 0, {}], ["swish_2", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}, {"name": "group_normalization_3", "class_name": "GroupNormalization", "config": {"name": "group_normalization_3", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "depthwise_conv2d_2", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_2", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "group_normalization_4", "class_name": "GroupNormalization", "config": {"name": "group_normalization_4", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_4", "class_name": "Swish", "config": {"name": "swish_4", "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxAAAAB0AGoBfACIAGQBZAKNA1MAKQNOVCkC2gRheGlz2ghr\nZWVwZGltcykC2gFL2gRtZWFuKQHaAWEpAdoMc3BhdGlhbF9kaW1zqQD6WC9rYWdnbGUvaW5wdXQv\nZWZmaWNpZW50bmV0L2VmZmljaWVudG5ldC1tYXN0ZXIvZWZmaWNpZW50bmV0LW1hc3Rlci9lZmZp\nY2llbnRuZXQvbW9kZWwucHnaCDxsYW1iZGE+XwAAAHMAAAAA\n", null, [[1, 2]]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["swish_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"name": "swish_5", "class_name": "Swish", "config": {"name": "swish_5", "trainable": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["swish_5", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "multiply_2", "class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true}, "inbound_nodes": [[["activation_2", 0, 0, {}], ["swish_4", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_2", 0, 0, {}]]]}, {"name": "group_normalization_5", "class_name": "GroupNormalization", "config": {"name": "group_normalization_5", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "drop_connect_1", "class_name": "DropConnect", "config": {"name": "drop_connect_1", "trainable": true, "drop_connect_rate": 0.025}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["drop_connect_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"name": "depthwise_conv2d_3", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_3", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "group_normalization_6", "class_name": "GroupNormalization", "config": {"name": "group_normalization_6", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_6", "class_name": "Swish", "config": {"name": "swish_6", "trainable": true}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxAAAAB0AGoBfACIAGQBZAKNA1MAKQNOVCkC2gRheGlz2ghr\nZWVwZGltcykC2gFL2gRtZWFuKQHaAWEpAdoMc3BhdGlhbF9kaW1zqQD6WC9rYWdnbGUvaW5wdXQv\nZWZmaWNpZW50bmV0L2VmZmljaWVudG5ldC1tYXN0ZXIvZWZmaWNpZW50bmV0LW1hc3Rlci9lZmZp\nY2llbnRuZXQvbW9kZWwucHnaCDxsYW1iZGE+XwAAAHMAAAAA\n", null, [[1, 2]]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["swish_6", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_3", 0, 0, {}]]]}, {"name": "swish_7", "class_name": "Swish", "config": {"name": "swish_7", "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["swish_7", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "multiply_3", "class_name": "Multiply", "config": {"name": "multiply_3", "trainable": true}, "inbound_nodes": [[["activation_3", 0, 0, {}], ["swish_6", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_3", 0, 0, {}]]]}, {"name": "group_normalization_7", "class_name": "GroupNormalization", "config": {"name": "group_normalization_7", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "drop_connect_2", "class_name": "DropConnect", "config": {"name": "drop_connect_2", "trainable": true, "drop_connect_rate": 0.037500000000000006}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["drop_connect_2", 0, 0, {}], ["add_1", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "group_normalization_8", "class_name": "GroupNormalization", "config": {"name": "group_normalization_8", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_8", "class_name": "Swish", "config": {"name": "swish_8", "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "depthwise_conv2d_4", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_4", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["swish_8", 0, 0, {}]]]}, {"name": "group_normalization_9", "class_name": "GroupNormalization", "config": {"name": "group_normalization_9", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_9", "class_name": "Swish", "config": {"name": "swish_9", "trainable": true}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxAAAAB0AGoBfACIAGQBZAKNA1MAKQNOVCkC2gRheGlz2ghr\nZWVwZGltcykC2gFL2gRtZWFuKQHaAWEpAdoMc3BhdGlhbF9kaW1zqQD6WC9rYWdnbGUvaW5wdXQv\nZWZmaWNpZW50bmV0L2VmZmljaWVudG5ldC1tYXN0ZXIvZWZmaWNpZW50bmV0LW1hc3Rlci9lZmZp\nY2llbnRuZXQvbW9kZWwucHnaCDxsYW1iZGE+XwAAAHMAAAAA\n", null, [[1, 2]]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["swish_9", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"name": "swish_10", "class_name": "Swish", "config": {"name": "swish_10", "trainable": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["swish_10", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "multiply_4", "class_name": "Multiply", "config": {"name": "multiply_4", "trainable": true}, "inbound_nodes": [[["activation_4", 0, 0, {}], ["swish_9", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_4", 0, 0, {}]]]}, {"name": "group_normalization_10", "class_name": "GroupNormalization", "config": {"name": "group_normalization_10", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "group_normalization_11", "class_name": "GroupNormalization", "config": {"name": "group_normalization_11", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_11", "class_name": "Swish", "config": {"name": "swish_11", "trainable": true}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "depthwise_conv2d_5", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_5", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["swish_11", 0, 0, {}]]]}, {"name": "group_normalization_12", "class_name": "GroupNormalization", "config": {"name": "group_normalization_12", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_12", "class_name": "Swish", "config": {"name": "swish_12", "trainable": true}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "lambda_5", "class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxAAAAB0AGoBfACIAGQBZAKNA1MAKQNOVCkC2gRheGlz2ghr\nZWVwZGltcykC2gFL2gRtZWFuKQHaAWEpAdoMc3BhdGlhbF9kaW1zqQD6WC9rYWdnbGUvaW5wdXQv\nZWZmaWNpZW50bmV0L2VmZmljaWVudG5ldC1tYXN0ZXIvZWZmaWNpZW50bmV0LW1hc3Rlci9lZmZp\nY2llbnRuZXQvbW9kZWwucHnaCDxsYW1iZGE+XwAAAHMAAAAA\n", null, [[1, 2]]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["swish_12", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_5", 0, 0, {}]]]}, {"name": "swish_13", "class_name": "Swish", "config": {"name": "swish_13", "trainable": true}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["swish_13", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "multiply_5", "class_name": "Multiply", "config": {"name": "multiply_5", "trainable": true}, "inbound_nodes": [[["activation_5", 0, 0, {}], ["swish_12", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_5", 0, 0, {}]]]}, {"name": "group_normalization_13", "class_name": "GroupNormalization", "config": {"name": "group_normalization_13", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "drop_connect_3", "class_name": "DropConnect", "config": {"name": "drop_connect_3", "trainable": true, "drop_connect_rate": 0.0625}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["drop_connect_3", 0, 0, {}], ["batch_normalization_10", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "group_normalization_14", "class_name": "GroupNormalization", "config": {"name": "group_normalization_14", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_14", "class_name": "Swish", "config": {"name": "swish_14", "trainable": true}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "depthwise_conv2d_6", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_6", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["swish_14", 0, 0, {}]]]}, {"name": "group_normalization_15", "class_name": "GroupNormalization", "config": {"name": "group_normalization_15", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_15", "class_name": "Swish", "config": {"name": "swish_15", "trainable": true}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "lambda_6", "class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxAAAAB0AGoBfACIAGQBZAKNA1MAKQNOVCkC2gRheGlz2ghr\nZWVwZGltcykC2gFL2gRtZWFuKQHaAWEpAdoMc3BhdGlhbF9kaW1zqQD6WC9rYWdnbGUvaW5wdXQv\nZWZmaWNpZW50bmV0L2VmZmljaWVudG5ldC1tYXN0ZXIvZWZmaWNpZW50bmV0LW1hc3Rlci9lZmZp\nY2llbnRuZXQvbW9kZWwucHnaCDxsYW1iZGE+XwAAAHMAAAAA\n", null, [[1, 2]]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["swish_15", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_6", 0, 0, {}]]]}, {"name": "swish_16", "class_name": "Swish", "config": {"name": "swish_16", "trainable": true}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["swish_16", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "multiply_6", "class_name": "Multiply", "config": {"name": "multiply_6", "trainable": true}, "inbound_nodes": [[["activation_6", 0, 0, {}], ["swish_15", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_6", 0, 0, {}]]]}, {"name": "group_normalization_16", "class_name": "GroupNormalization", "config": {"name": "group_normalization_16", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "drop_connect_4", "class_name": "DropConnect", "config": {"name": "drop_connect_4", "trainable": true, "drop_connect_rate": 0.07500000000000001}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["drop_connect_4", 0, 0, {}], ["add_3", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "group_normalization_17", "class_name": "GroupNormalization", "config": {"name": "group_normalization_17", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_17", "class_name": "Swish", "config": {"name": "swish_17", "trainable": true}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "depthwise_conv2d_7", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_7", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["swish_17", 0, 0, {}]]]}, {"name": "group_normalization_18", "class_name": "GroupNormalization", "config": {"name": "group_normalization_18", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_18", "class_name": "Swish", "config": {"name": "swish_18", "trainable": true}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"name": "lambda_7", "class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxAAAAB0AGoBfACIAGQBZAKNA1MAKQNOVCkC2gRheGlz2ghr\nZWVwZGltcykC2gFL2gRtZWFuKQHaAWEpAdoMc3BhdGlhbF9kaW1zqQD6WC9rYWdnbGUvaW5wdXQv\nZWZmaWNpZW50bmV0L2VmZmljaWVudG5ldC1tYXN0ZXIvZWZmaWNpZW50bmV0LW1hc3Rlci9lZmZp\nY2llbnRuZXQvbW9kZWwucHnaCDxsYW1iZGE+XwAAAHMAAAAA\n", null, [[1, 2]]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["swish_18", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_7", 0, 0, {}]]]}, {"name": "swish_19", "class_name": "Swish", "config": {"name": "swish_19", "trainable": true}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["swish_19", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "multiply_7", "class_name": "Multiply", "config": {"name": "multiply_7", "trainable": true}, "inbound_nodes": [[["activation_7", 0, 0, {}], ["swish_18", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_7", 0, 0, {}]]]}, {"name": "group_normalization_19", "class_name": "GroupNormalization", "config": {"name": "group_normalization_19", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "drop_connect_5", "class_name": "DropConnect", "config": {"name": "drop_connect_5", "trainable": true, "drop_connect_rate": 0.08750000000000001}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["drop_connect_5", 0, 0, {}], ["add_4", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "group_normalization_20", "class_name": "GroupNormalization", "config": {"name": "group_normalization_20", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_20", "class_name": "Swish", "config": {"name": "swish_20", "trainable": true}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"name": "depthwise_conv2d_8", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_8", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["swish_20", 0, 0, {}]]]}, {"name": "group_normalization_21", "class_name": "GroupNormalization", "config": {"name": "group_normalization_21", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_21", "class_name": "Swish", "config": {"name": "swish_21", "trainable": true}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "lambda_8", "class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxAAAAB0AGoBfACIAGQBZAKNA1MAKQNOVCkC2gRheGlz2ghr\nZWVwZGltcykC2gFL2gRtZWFuKQHaAWEpAdoMc3BhdGlhbF9kaW1zqQD6WC9rYWdnbGUvaW5wdXQv\nZWZmaWNpZW50bmV0L2VmZmljaWVudG5ldC1tYXN0ZXIvZWZmaWNpZW50bmV0LW1hc3Rlci9lZmZp\nY2llbnRuZXQvbW9kZWwucHnaCDxsYW1iZGE+XwAAAHMAAAAA\n", null, [[1, 2]]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["swish_21", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"name": "conv2d_28", "trainable": true, "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_8", 0, 0, {}]]]}, {"name": "swish_22", "class_name": "Swish", "config": {"name": "swish_22", "trainable": true}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["swish_22", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "multiply_8", "class_name": "Multiply", "config": {"name": "multiply_8", "trainable": true}, "inbound_nodes": [[["activation_8", 0, 0, {}], ["swish_21", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_8", 0, 0, {}]]]}, {"name": "group_normalization_22", "class_name": "GroupNormalization", "config": {"name": "group_normalization_22", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "drop_connect_6", "class_name": "DropConnect", "config": {"name": "drop_connect_6", "trainable": true, "drop_connect_rate": 0.1}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["drop_connect_6", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"name": "conv2d_31", "class_name": "Conv2D", "config": {"name": "conv2d_31", "trainable": true, "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "group_normalization_23", "class_name": "GroupNormalization", "config": {"name": "group_normalization_23", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_23", "class_name": "Swish", "config": {"name": "swish_23", "trainable": true}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"name": "depthwise_conv2d_9", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_9", "trainable": true, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["swish_23", 0, 0, {}]]]}, {"name": "group_normalization_24", "class_name": "GroupNormalization", "config": {"name": "group_normalization_24", "trainable": true, "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": []}, {"name": "swish_24", "class_name": "Swish", "config": {"name": "swish_24", "trainable": true}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"name": "lambda_9", "class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxAAAAB0AGoBfACIAGQBZAKNA1MAKQNOVCkC2gRheGlz2ghr\nZWVwZGltcykC2gFL2gRtZWFuKQHaAWEpAdoMc3BhdGlhbF9kaW1zqQD6WC9rYWdnbGUvaW5wdXQv\nZWZmaWNpZW50bmV0L2VmZmljaWVudG5ldC1tYXN0ZXIvZWZmaWNpZW50bmV0LW1hc3Rlci9lZmZp\nY2llbnRuZXQvbW9kZWwucHnaCDxsYW1iZGE+XwAAAHMAAAAA\n", null, [[1, 2]]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["swish_24", 0, 0, {}]]]}, {"name": "conv2d_32", "class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "EfficientConv2DKernelInitializer", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_9", 0, 0, {}]]]}, 